app/Http/Controllers/Api/PostsController.php

    public function index(Request $request)
    {
       // return  $request->all();
    //select products in selected categories
         $main_cate_id=$request->category_id;
         $sub2_id=$request->sub_category_id;
         $sub3_id=$request->type_id;
        $lang=$request->header('locale');

         if($request->perpage){$perpage=$request->perpage;}else{$perpage=10;}

         if($lang=='ar'){
             $selected="title_ar as title";
         }else{
              $selected="title_en as title";
         }
         //stock=amunt
         //min=min_amount
         //max=max_amount
         //security_clearance
         $posts =  PostsResource::collection(Article::select('id',$selected,'image')->where('main_cate_id',$main_cate_id)->where('sub2_id',$sub2_id)->where('sub3_id',$sub3_id)->where('status','1')->paginate($perpage));
---
select `id`, `title_en` as `title`, `image` from `articles` where `main_cate_id` = '1' and `sub2_id` = '1' and `sub3_id` = '1' and `status` = '1' limit 10 offset 0
select count(*) as aggregate from `articles` where `main_cate_id` = '1' and `sub2_id` = '1' and `sub3_id` = '1' and `status` = '1'