app/Http/Controllers/Pages/PageController.php

    public function index()
    {
        $Page=Page::all();
---
select * from `pages`