app/Http/Controllers/Article/ArticleController.php

    public function index()
    {
        $Art=Article::all();
---
select * from `articles`